Revit 2027 API
DocumentSynchronizingWithCentralEventArgs.Location Property
 Full path of the central model which is to be synchronized.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Location { get; }
Public ReadOnly Property Location As String
	Get
public:
property String^ Location {
	String^ get ();
}
member Location : string with get
Property Value
String
See Also
Reference
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace